from tabulate import tabulate

# Ваши данные
data = [
    ["BTC", 38103.70, "+2.92%"],
    ["ETH", 2057.22, "+2.44%"],
    ["USTC", 0.0541700, "+46.33%"],
    ["1000LUNC", 0.1212300, "+31.70%"],
    ["SEI", 0.2787000, "+28.61%"],
    ["MDT", 0.1024700, "+26.16%"],
    ["STX", 0.7703000, "+22.37%"],
    ["COCOS", 1.454000, "-6.97%"],
    ["ALICE", 1.119, "-4.77%"],
    ["XVS", 6.685000, "-3.90%"],
    ["ETHW", 2.906000, "-3.65%"],
    ["TRU", 0.0566400, "-3.43%"],
]

# Заголовки столбцов
headers = ["Крипто", "Цена", "Изменение"]

# Отобразить данные в виде таблицы
table = tabulate(data, headers, tablefmt="pretty")

print(table)